a= 73/6; %Перевел в неправильную дробь
b= 163/27;
c=5.25;
d=13.5;
e=0.111;
f=0.02;
((a-b-c)*d+e)/f



r=1; %
sprintf('Радіус r=%f м/n', r)
sprintf('Довжина окружності L=%4.3f м\n', 2*pi*r)
fprintf('Радіус r=%4.2f м\n', r)
fprintf('Довжина окружності L=%4.3f м\n', 2*pi*r)
r=[1 2 3 ];
fprintf('Радіус r=%4.2f м\n', r)
fprintf('Довжина окружності L=%4.3f м\n', 2*pi*r)

%r=1;
%sprintf('Радіус r=%4.2f м ', r)
%sprintf('Довжина окружності L=%4.3f м ', 2*pi*r)
%fprintf('Радіус r=%4.2f м ', r)
%fprintf('Довжина окружності L=%4.3f м ', 2*pi*r)
%r=[1 2 3];
%fprintf('Радіус r=%4.2f м ', r)
%fprintf('Довжина окружності L=%4.3f м ', 2*pi*r)

m=14/5;
n= tan(pi/18);
3*(m^2)+(n^2)^(1/3)/m;

m=2.2*10^-2;
n= 1/3.1;
3*(m^2)+(n^2)^(1/3)/m;


