a=0.56;
b=1.2e-4;
c=4.08;
d=b^2-4*a*c;
%ax^2+bx+c=0
fprintf('%.1f*x^2+%.1f*x+%.1f=0\n',a, b, c)
if d>0
    x1=(-b+sqrt(d))/(2*a);
    x2=(-b-sqrt(d))/(2*a);
    fprintf('Розрахований дискримінант d=%4.2f . Рівняння має 2 кореня: \n', d)
    fprintf('Корни уровнения: x1=%4.2f ', x1)
    fprintf('x2=%4.2f \n', x2)
    

elseif d==0
    x=-b\2*a;
    fprintf('Дискримінант d=%4.2f, рівняння має 1 корень \n', d)
    fprintf('x=%4.2f ', x)
        
else
    fprintf('Дискримінант d=%4.2f, \n ', d)

    disp('Дискримінант  меньше нуля, розрахунок неможливий ')
end

z1=4+3i;
z2=2.7*exp(i*pi/12);
z3=1.82*exp(-1.2i);
z4=sqrt(3)-2i;

p=(z1^2*z2/z3)+z4









